#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
panos_panorama_device_group.this: Refreshing state... [id=production]
panos_antivirus_security_profile.example: Refreshing state... [id=production:av]
panos_panorama_security_rule_group.this: Refreshing state... [id=production:pre-rulebase:0::YWxsb3cgZG5zIGZyb20gYXBwcwphbGxvdyBpbnRlcm5ldCBmcm9tIGJpemRldiB4]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # panos_panorama_security_rule_group.this has been changed
  ~ resource "panos_panorama_security_rule_group" "this" {
        id           = "production:pre-rulebase:0::YWxsb3cgZG5zIGZyb20gYXBwcwphbGxvdyBpbnRlcm5ldCBmcm9tIGJpemRldiB4"
        # (2 unchanged attributes hidden)

      ~ rule {
            name                               = "allow dns from apps"
          + tags                               = []
            # (20 unchanged attributes hidden)
        }
      ~ rule {
            name                               = "allow internet from bizdev x"
          + tags                               = []
            # (20 unchanged attributes hidden)
        }
    }
  # panos_antivirus_security_profile.example has been changed
  ~ resource "panos_antivirus_security_profile" "example" {
        id                = "production:av"
        name              = "av"
      + threat_exceptions = []
        # (4 unchanged attributes hidden)


        # (8 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # panos_panorama_static_route_ipv4.this["azure"] will be created
  + resource "panos_panorama_static_route_ipv4" "this" {
      + destination    = "172.16.0.0/16"
      + id             = (known after apply)
      + metric         = 10
      + name           = "azure"
      + next_hop       = "172.16.0.1"
      + route_table    = "unicast"
      + template       = "production TPL"
      + type           = "ip-address"
      + virtual_router = "vr"
    }

  # panos_panorama_static_route_ipv4.this["default"] will be created
  + resource "panos_panorama_static_route_ipv4" "this" {
      + destination    = "0.0.0.0/0"
      + id             = (known after apply)
      + metric         = 10
      + name           = "default"
      + next_hop       = "10.2.1.1"
      + route_table    = "unicast"
      + template       = "production TPL"
      + type           = "ip-address"
      + virtual_router = "vr"
    }

  # panos_panorama_static_route_ipv4.this["on-prem"] will be created
  + resource "panos_panorama_static_route_ipv4" "this" {
      + destination    = "192.168.0.0/16"
      + id             = (known after apply)
      + metric         = 10
      + name           = "on-prem"
      + next_hop       = "192.168.0.1"
      + route_table    = "unicast"
      + template       = "production TPL"
      + type           = "ip-address"
      + virtual_router = "vr"
    }

  # panos_panorama_template.this will be created
  + resource "panos_panorama_template" "this" {
      + default_vsys = (known after apply)
      + description  = "production template"
      + id           = (known after apply)
      + name         = "production TPL"

      + devices {
          + serial    = (known after apply)
          + vsys_list = (known after apply)
        }
    }

  # panos_panorama_template_stack.this will be created
  + resource "panos_panorama_template_stack" "this" {
      + description = "production TPL STK"
      + devices     = (known after apply)
      + id          = (known after apply)
      + name        = "production TPL STK"
      + templates   = [
          + "production TPL",
        ]
    }

  # panos_panorama_virtual_router.this will be created
  + resource "panos_panorama_virtual_router" "this" {
      + ebgp_dist        = 20
      + ibgp_dist        = 200
      + id               = (known after apply)
      + interfaces       = (known after apply)
      + name             = "vr"
      + ospf_ext_dist    = 110
      + ospf_int_dist    = 30
      + ospfv3_ext_dist  = 110
      + ospfv3_int_dist  = 30
      + rip_dist         = 120
      + static_dist      = 15
      + static_ipv6_dist = 10
      + template         = "production TPL"
      + vsys             = "vsys1"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @migara, Action: `pull_request`*